Revit 2024 API
Generic.GenericSelfIllumColorTemperature Property
 The property labeled "Color Temperature" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GenericSelfIllumColorTemperature { get; }
Visual Basic
Public Shared ReadOnly Property GenericSelfIllumColorTemperature As String
	Get
Visual C++
public:
static property String^ GenericSelfIllumColorTemperature {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace